vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/ICACHE_registers.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the ICACHE register type definitions for the stm32h503 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "ICACHE_index.h"


typedef union {
	struct {
		uint32_t EN            : 1; // /*!< Enable */
		uint32_t CACHEINV      : 1; // /*!< Cache invalidation */
		uint32_t WAYSEL        : 1; // /*!< Ways selection */
		uint32_t _reserved3    :13;
		uint32_t HITMEN        : 1; // /*!< Hit monitor enable */
		uint32_t MISSMEN       : 1; // /*!< Miss monitor enable */
		uint32_t HITMRST       : 1; // /*!< Hit monitor reset */
		uint32_t MISSMRST      : 1; // /*!< Miss monitor reset */
		uint32_t _reserved20   :12;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_icache,cr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_icache,cr),bits);

typedef union {
	struct {
		uint32_t BUSYF         : 1; // /*!< Busy flag */
		uint32_t BSYENDF       : 1; // /*!< Busy end flag */
		uint32_t ERRF          : 1; // /*!< Cache error flag */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_icache,sr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_icache,sr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 1;
		uint32_t BSYENDIE      : 1; // /*!< Busy end interrupt enable */
		uint32_t ERRIE         : 1; // /*!< Cache error interrupt enable */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_icache,ier);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_icache,ier),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 1;
		uint32_t CBSYENDF      : 1; // /*!< Busy end flag clear */
		uint32_t CERRF         : 1; // /*!< Cache error flag clear */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_icache,fcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_icache,fcr),bits);

typedef union {
	struct {
		uint32_t HITMON        :32; // /*!< Cache hit monitor register */
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_icache,hmonr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_icache,hmonr),bits);

typedef union {
	struct {
		uint32_t MISSMON       :16; // /*!< Cache miss monitor register */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_icache,mmonr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_icache,mmonr),bits);

static const stm32_reginfo_t stm32_h503_icache_reginfo[RI_END] =
{
	[RI_CR             ] = { .reset_val = 0x00000004, .not_reserved = true, .unimp_mask = 0x000F0007, .mask = 0x000F0007 }, /* mask = 0b00000000000011110000000000000111 */
	[RI_SR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000007, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_IER            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000006, .mask = 0x00000006 }, /* mask = 0b00000000000000000000000000000110 */
	[RI_FCR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000006, .mask = 0x00000006 }, /* mask = 0b00000000000000000000000000000110 */
	[RI_HMONR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0xFFFFFFFF, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_MMONR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000FFFF, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
};

typedef union {
	struct {
		REGDEF_NAME(h503_icache,cr) CR;
		REGDEF_NAME(h503_icache,sr) SR;
		REGDEF_NAME(h503_icache,ier) IER;
		REGDEF_NAME(h503_icache,fcr) FCR;
		REGDEF_NAME(h503_icache,hmonr) HMONR;
		REGDEF_NAME(h503_icache,mmonr) MMONR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(h503,icache);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(h503,icache)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,icache), CR) != 0, "Offset mismatch for CR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,icache), SR) != 4, "Offset mismatch for SR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,icache), IER) != 8, "Offset mismatch for IER");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,icache), FCR) != 12, "Offset mismatch for FCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,icache), HMONR) != 16, "Offset mismatch for HMONR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,icache), MMONR) != 20, "Offset mismatch for MMONR");
